



* Example 2

#+TBLNAME: NPV
| $ | rate=.07       |
| $ | n=50           |
| $ | payment = 1000 |
| # | 13800.746      |
| ^ | Result         |
#+TBLFM: $Result=pv($rate,$n,$payment)

#+LATEX_HEADER: \usepackage{threeparttable}
#+AUTHOR: 
#+LATEX: \begin{table}
#+LATEX: \centering
#+LATEX: \begin{threeparttable}
#+TBLNAME: DCF
|   |     Year |       Growth |     Cash | Discounted Cash |
|---+----------+--------------+----------+-----------------|
| # |        0 |              |      500 |             500 |
| # |        1 |\(0.15\)\tnote{4}|\(575.00\)\tnote{3}|\(527.52\)\tnote{1}|
| # |        2 |\(0.15\)\tnote{4}|\(661.25\)\tnote{3}|\(556.56\)\tnote{1}|
| # |        3 |\(0.15\)\tnote{4}|\(760.44\)\tnote{3}|\(587.20\)\tnote{1}|
| # |        4 |\(0.15\)\tnote{4}|\(874.51\)\tnote{3}|\(619.52\)\tnote{1}|
| # |        5 |\(0.15\)\tnote{4}|\(1005.69\)\tnote{3}|\(653.63\)\tnote{1}|
| # |        6 |\(0.05\)\tnote{5}|\(1055.97\)\tnote{3}|\(629.64\)\tnote{1}|
| # |        7 |\(0.05\)\tnote{5}|\(1108.77\)\tnote{3}|\(606.54\)\tnote{1}|
| # |        8 |\(0.05\)\tnote{5}|\(1164.21\)\tnote{3}|\(584.28\)\tnote{1}|
| # |        9 |\(0.05\)\tnote{5}|\(1222.42\)\tnote{3}|\(562.84\)\tnote{1}|
| # |       10 |\(0.05\)\tnote{5}|\(1283.54\)\tnote{3}|\(542.18\)\tnote{1}|
| # |       10 | (perpetuity) |\(22034.10\)\tnote{2}|\(9307.44\)\tnote{1}|
|   |          |              |          |\(15677.35\)\tnote{6}|
| ^ |          |              |          |             DCF |
| $ | g1t5=.15 |    g6t10=.05 |          |                 |
| $ |  COE=.09 |        g=.03 |          |                 |
#+TBLFM: @3$3=\mbox{$g1t5}::@3$4=@-1*(1+$-1)::@3$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@4$3=\mbox{$g1t5}::@4$4=@-1*(1+$-1)::@4$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@5$3=\mbox{$g1t5}::@5$4=@-1*(1+$-1)::@5$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@6$3=\mbox{$g1t5}::@6$4=@-1*(1+$-1)::@6$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@7$3=\mbox{$g1t5}::@7$4=@-1*(1+$-1)::@7$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@8$3=\mbox{$g6t10}::@8$4=@-1*(1+$-1)::@8$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@9$3=\mbox{$g6t10}::@9$4=@-1*(1+$-1)::@9$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@10$3=\mbox{$g6t10}::@10$4=@-1*(1+$-1)::@10$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@11$3=\mbox{$g6t10}::@11$4=@-1*(1+$-1)::@11$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@12$3=\mbox{$g6t10}::@12$4=@-1*(1+$-1)::@12$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@13$4=(@-1(1+\mbox{$g}))/(\mbox{$COE}-\mbox{$g})::@13$5=$-1*(1/(1+\mbox{$COE})^{$-3})::@14$5=vsum(@2..@-1)

\begin{tablenotes}
\item [1] \(\$-1*(1/(1+\mbox{\$COE})^{\$-3})\)
\item [2] \((@-1(1+\mbox{\$g}))/(\mbox{\$COE}-\mbox{\$g})\)
\item [3] \(@-1*(1+\$-1)\)
\item [4] \(\mbox{\$g1t5}\)
\item [5] \(\mbox{\$g6t10}\)
\item [6] \(vsum(@2..@-1)\)
\end{tablenotes}

#+LATEX: \end{threeparttable}
#+LATEX: \end{table}


#+LATEX_HEADER: \usepackage{threeparttable}
#+AUTHOR: 
#+LATEX: \begin{table}
#+LATEX: \centering
#+LATEX: \begin{threeparttable}

|   | Column A                 | Column B                 |
|---+--------------------------+--------------------------|
| / |                          | <                        |
|   | \(5\)\tnote{5}           |                          |
|   | \(\frac{1}{5}\)\tnote{4} |                          |
|   | \(\frac{1}{2}\)\tnote{3} | \(\frac{1}{4}\)\tnote{2} |
|   |                          | \(25\)\tnote{1}          |
| $ | parameter=5              |                          |
|   | \(25\)\tnote{6}          |                          |
|---+--------------------------+--------------------------|
#+TBLFM: @3$2=\mbox{$parameter}::@4$2=\frac{2}{10}::@5$2=\frac{1}{2}::@5$3=\frac{$2}{2}::@6$3=@-1*100::@8$2=\mbox{$parameter}*5

\begin{tablenotes}
\item [1] \(@-1*100\)
\item [2] \(\frac{\$2}{2}\)
\item [3] \(\frac{1}{2}\)
\item [4] \(\frac{2}{10}\)
\item [5] \(\mbox{\$parameter}\)
\item [6] \(\mbox{\$parameter}*5\)
\end{tablenotes}

#+LATEX: \end{threeparttable}
#+LATEX: \end{table}



#+LATEX_HEADER: \usepackage{threeparttable}
#+AUTHOR: 
#+LATEX: \begin{table}
#+LATEX: \centering
#+LATEX: \begin{threeparttable}

| COE |\(DCF\)\tnote{1}|
|-----+--------------|
| .04 |     97480.87 |
| .05 |     48332.71 |
| .06 |     31973.63 |
| .07 |     23810.54 |
| .08 |     18924.93 |
| .09 |     15677.35 |
| .10 |     13365.25 |
| .11 |     11637.39 |
| .12 |     10298.65 |
#+TBLFM: $2='(org-table-xtras-eval-table "DCF" '(("COE" . $1)) "DCF")

\begin{tablenotes}
\item [1] \('(org-table-xtras-eval-table "DCF" '(("COE" . \$1)) "DCF")\)
\end{tablenotes}

#+LATEX: \end{threeparttable}
#+LATEX: \end{table}
